/**
 *  Hooks
 * 
 *  Основні правила для написання хуків:
 *  - Хук повинен бути функцією, яка починається з use. Це дозволяє React розпізнати хуки в коді і використовувати інші хуки в них
 *  - Хук повинен повертати масив з двох елементів: [значення, функція для зміни значення]
 *  - Хук повинен бути універсальним (не повинен бути прив'язаний до конкретного компонента) 
 *  - Хук повинен викликатися в компоненті на вершньому рівні не умовно
 *  - Сет функція не оновлює значення моментально (вона ставить нове значення в чергу на оновлення) 
 */
